#  Data Input and Output in Pandas
---
## Data Sources 
* CSV
* Excel
* HTML
* SQL

##  SQL/HTML Package installation (conda or pip install)

*  conda install sqlalchemy
*  conda install lxml
*  conda install html5lib
*  conda install BeautifulSoup4

In [1]:
import pandas as pd

##  Reading CSV File

In [2]:
#  Reading csv files
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

##  Writing to CSV

In [3]:
df = pd.read_csv('example.csv')

In [4]:
#  Write to CSV file and don't save the index
df.to_csv('data_write.csv',index=False)

## Reading and Writing to Excel files
---

In [5]:
#  Reading from excel files
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
#  Writing to excel files
df.to_excel('Write_To_Excel.xlsx',sheet_name="NewSheet")

## Reading and Writing to HTML
---

In [7]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [8]:
type(data)

list

In [9]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","July 26, 2017"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"

##  Reading into SQL
---

In [10]:
#  Search for a SQL library you should use
from sqlalchemy import create_engine

In [11]:
engine = create_engine('sqlite:///:memory:')

In [12]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
df.to_sql('my_table',engine)

In [14]:
sqldf = pd.read_sql('my_table',con=engine)

In [15]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15